Tekla Open API Reference for Tekla Structures 2025
FacetedBrep.Faces Property
 Gets the faces.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ICollection<FacetedBrepFace> Faces { get; }
Public ReadOnly Property Faces As ICollection(Of FacetedBrepFace)
	Get
Property Value
Type: ICollection<FacetedBrepFace>
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace